name: AWS Disabled MFA
description: |
  'Multi-Factor Authentication (MFA) helps prevent credential compromise. This alert identifies when an attempt has been made to diable MFA for a user'
severity: Medium
enabled: false
requiredDataConnectors:
  - connectorId: AWSCloudTrailLogs
    dataTypes:
      - AWSCloudTrailLogs
queryFrequency: 5m
queryPeriod: 5m
suppressionDuration: 5m
triggerOperator: gt
triggerThreshold: 0
incidentConfiguration:
  createIncident: true
  groupingConfiguration: 
    enabled: True
    reopenClosedIncident: False
    lookbackDuration: 5h
    entitiesMatchingMethod: all
    groupByEntities:
tactics:
  - Persistence
relevantTechniques:
query: |
  let timeframe = 1d;
  (union isfuzzy=true
  (AuditLogs 
  | where TimeGenerated >= ago(timeframe) 
  | where OperationName =~ "Disable Strong Authentication"
  | extend IPAddress = tostring(parse_json(tostring(InitiatedBy.user)).ipAddress) 
  | extend InitiatedByUser = iff(isnotempty(tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)), 
  tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName), tostring(parse_json(tostring(InitiatedBy.app)).displayName))
  | extend Targetprop = todynamic(TargetResources)
  | extend TargetUser = tostring(Targetprop[0].userPrincipalName) 
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by User = TargetUser, InitiatedByUser , Operation = OperationName , CorrelationId, IPAddress, Category, Source = SourceSystem , AADTenantId, Type
  ),
  (AWSCloudTrail
  | where TimeGenerated >= ago(timeframe)
  | where EventName in~ ("DeactivateMFADevice", "DeleteVirtualMFADevice") 
  | extend InstanceProfileName = tostring(parse_json(RequestParameters).InstanceProfileName)
  | extend TargetUser = tostring(parse_json(RequestParameters).userName)
  | summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by User = TargetUser, Source = EventSource , Operation = EventName , TenantorInstance_Detail = InstanceProfileName, IPAddress = SourceIpAddress
  )
  )
  | extend timestamp = StartTimeUtc, AccountCustomEntity = User, IPCustomEntity = IPAddress