name: Deleting Backup Catalogs
description: |
  'Identifies use of the wbadmin.exe to delete the backup catalog. Ransomware and other malware may do this to prevent system recovery.'
severity: Medium
enabled: false
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 5m
queryPeriod: 5m
suppressionDuration: 5m
triggerOperator: gt
triggerThreshold: 0
incidentConfiguration:
  createIncident: true
  groupingConfiguration: 
    enabled: True
    reopenClosedIncident: False
    lookbackDuration: 5h
    entitiesMatchingMethod: all
    groupByEntities:
tactics:
  - DefenseEvasion
relevantTechniques:
  - TA0005
query: |
  SecurityEvent 
  | where Channel == "Security"
  | where AccountType == "User"
  | where EventID  == "4688"
  | where CommandLine contains "wbadmin"
  | extend AccountCustomEntity = Account 
  | extend HostCustomEntity = Computer