name: Clearing Windows Event Logs
description: |
  'Identifies attempts to clear Windows event log stores. This is often done by attackers in an attempt to evade detection or destroy forensic evidence on a system.'
severity: Medium
enabled: false
requiredDataConnectors:
  - connectorId: SecurityEvents
    dataTypes:
      - SecurityEvent
queryFrequency: 5m
queryPeriod: 5m
suppressionDuration: 5m
triggerOperator: gt
triggerThreshold: 0
incidentConfiguration:
  createIncident: true
  groupingConfiguration: 
    enabled: True
    reopenClosedIncident: False
    lookbackDuration: 5h
    entitiesMatchingMethod: all
    groupByEntities:
tactics:
  - DefenseEvasion
relevantTechniques:
  - T1070
query: |
  SecurityEvent
  | where AccountType == "User"
  | where Channel == "Security"
  | where EventID == "4688"
  | where CommandLine contains "wevtutil.exe" and CommandLine contains "cl"
  or CommandLine contains "Clear-EventLog"
  | extend AccountCustomEntity = Account 
  | extend HostCustomEntity = Computer